In [7]:
%config Completer.use_jedi = False #this is command used for enable autocompletion in jupyt notebook

In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

# 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [10]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [11]:
t=df[['FlightNumber']]

In [12]:
t

   FlightNumber
0       10045.0
1           NaN
2       10065.0
3           NaN
4       10085.0

In [13]:
t[1:2]

   FlightNumber
1           NaN

In [14]:
t[1:2]=10055

C:\Users\SANU\Miniconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\SANU\Miniconda3\lib\site-packages\pandas\core\frame.py:3051: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.iloc._setitem_with_indexer(key, value)
C:\Users\SANU\Miniconda3\lib\site-packages\pandas\core\frame.py:3036: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._setitem_slice(indexer, value)

In [15]:
t[3:4]=10075

C:\Users\SANU\Miniconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [16]:
t

   FlightNumber
0       10045.0
1       10055.0
2       10065.0
3       10075.0
4       10085.0

In [17]:
df['FlightNumber']=t

In [18]:
t

   FlightNumber
0       10045.0
1       10055.0
2       10065.0
3       10075.0
4       10085.0

In [19]:
FligtNumber=[]
for i in df['FlightNumber']:
    j = int(i)
    FligtNumber.append(j)
FligtNumber

[10045, 10055, 10065, 10075, 10085]

In [20]:
df['FlightNumber']=FligtNumber

In [21]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [22]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [23]:
new=df["From_To"].str.split("_",n=1,expand=True)

In [24]:
new

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [25]:
new[0]

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: 0, dtype: object

In [26]:
new[1]

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: 1, dtype: object

In [27]:
df['From_to_']=new[0]

In [28]:
df['temporary']=new[1]

In [29]:
df

,From_To,FlightNumber,RecentDelays,Airline,From_to_,temporary
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [30]:
df

,From_To,FlightNumber,RecentDelays,Airline,From_to_,temporary
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

# 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)
## 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [31]:
df

,From_To,FlightNumber,RecentDelays,Airline,From_to_,temporary
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [32]:
df

,From_To,FlightNumber,RecentDelays,Airline,From_to_,temporary
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [33]:
df1=df.drop("From_To",axis=1)

In [34]:
y=[]
z=[]
for i in df1["temporary"]:
    cap=i.capitalize()
    y.append(cap)
for j in df1['From_to_']:
    cap=j.capitalize()
    z.append(cap)

In [35]:
df1["temporary"]=y
df1['From_to_']=z

In [36]:
df1

   FlightNumber  RecentDelays              Airline  From_to_  temporary
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [37]:
df1

   FlightNumber  RecentDelays              Airline  From_to_  temporary
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [89]:
delays = df['RecentDelays'].apply(pd.Series)

In [90]:
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [102]:

delays["delya_1"]=delays[0]
delays["delya_2"]=delays[1]
delays["delya_3"]=delays[2]

In [105]:
delays.drop(columns=[0,1,2])

   delya_1  delya_2  delya_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [107]:
delays

      0     1     2  delya_1  delya_2  delya_3
0  23.0  47.0   NaN     23.0     47.0      NaN
1   NaN   NaN   NaN      NaN      NaN      NaN
2  24.0  43.0  87.0     24.0     43.0     87.0
3  13.0   NaN   NaN     13.0      NaN      NaN
4  67.0  32.0   NaN     67.0     32.0      NaN

In [108]:
delays.drop(columns=[0,1,2],inplace=True)

In [109]:
delays

   delya_1  delya_2  delya_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN